clase54/app/controllers/movies_controller.rb

  def create
    @movie = Movie.new(movie_params)
    tags_ids = movie_params[:tags_ids].delete_if{|i| i.empty?}
    @tags = Tag.find([tags_ids])
    @movie.tags = []
    @movie.tags << @tags
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
INSERT INTO "movie_tags" ("movie_id", "tag_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["movie_id", 3], ["tag_id", 1], ["created_at", "2017-07-27 02:01:54.886235"], ["updated_at", "2017-07-27 02:01:54.886235"]]
INSERT INTO "movies" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Matrix"], ["created_at", "2017-07-27 01:09:39.484834"], ["updated_at", "2017-07-27 01:09:39.484834"]]