clase54/app/views/movies/_form.html.erb

SELECT "tags".* FROM "tags"
---
<!--     <%= form.select(:tags_ids, Tag.all.map{|t| [t.name, t.id]},{},multiple: true) %><br> -->
    <%= collection_check_boxes(:movie, :tags_ids, Tag.all, :id, :name) %>