clase54/app/views/movies/index.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "movie_tags" ON "tags"."id" = "movie_tags"."tag_id" WHERE "movie_tags"."movie_id" = $1  [["movie_id", 1]]
---
        <td><%= movie.name %></td>
        <td><%= movie.tags.collect(&:name) %> </td>